'''
Программа принимает действительное положительное число x и целое отрицательное число y.
 Необходимо выполнить возведение числа x в степень y.
  Задание необходимо реализовать в виде функции my_func(x, y).
   При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
Подсказка: попробуйте решить задачу двумя способами.
 Первый — возведение в степень с помощью оператора **.
  Второй — более сложная реализация без оператора **, предусматривающая использование цикла.
'''

def my_func_1(x, y):
    try:
        x = float(x)
        y = int(y)
        return x ** y
    except ValueError as e:
        return f'Неправильно заданы числа'

def my_func_2(x, y):
    try:
        x = float(x)
        y = int(y)
        s = 1
        for i in range(y):
            s = s * x
        return s
    except ValueError as e:
        return f'Неправильно заданы числа'

print(my_func_1(0.99, 365))
print(my_func_2(0.99, 365))