'''
Создать список и заполнить его элементами различных типов данных.
Реализовать скрипт проверки типа данных каждого элемента.
Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
'''
lst = [4221, False, 5.33, '5.33', {1:'1', 2:'2', 3:[1,2,3]}, set('abvgd')]
for i in range(len(lst)):
    print(f'{i}-й элемент списка. Тип элемента: {type(lst[i])}')