"""
* Реализовать структуру данных «Товары».
Она должна представлять собой список кортежей.
Каждый кортеж хранит информацию об отдельном товаре.
В кортеже должно быть два элемента — номер товара и словарь с параметрами
(характеристиками товара: название, цена, количество, единица измерения).
Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.
Пример готовой структуры:
[
(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
]
Необходимо собрать аналитику о товарах.
Реализовать словарь, в котором каждый ключ — характеристика товара,
например название, а значение — список значений-характеристик, например список названий товаров.
Пример:
{
“название”: [“компьютер”, “принтер”, “сканер”],
“цена”: [20000, 6000, 2000],
“количество”: [5, 2, 7],
“ед”: [“шт.”]
}
"""
# для использования заготвленного списка в названии в коде нужно использовать список с именем lst_
lst_ = [
(1, {'название': 'компьютер', 'цена': 20000, 'количество': 5, 'eд': 'c'}),
(2, {'название': 'принтер', 'цена': 6000, 'количество': 2, 'eд': 'шт'}),
(3, {'название': 'сканер', 'цена': 2000, 'количество': 7, 'eд': 'шт'})
]
lst = []
dct = {}
i = 0
while True:
    print(f'Введите "next" если хотите заполнить данные, "structure" если посмотреть структуру,'
          f' "analytic" если хотите посмотреть аналитику и  "exit" для выхода')
    command = input('Введите команду: ')
    if command == 'exit':
        break
    elif command == 'analytic':
        if len(dct) == 0:
            print(f'Данных нет. Нечего анализировать')
        else:
            print(dct)
    elif command == 'structure':
        if len(lst) == 0:
            print(f'Структура пуста. Данных нет')
        else:
            print(lst)
    elif command == 'next':
        name = input(f'Введите название товара: ')
        price = int(input(f'Введите цену за товар: '))
        qty = int(input(f'Введите количество товара: '))
        item = input(f'Введите единицу измерения: ')
        lst.append((i+1, {'название': name, 'цена': price, 'количество': qty, 'ед': item},))

        for i in range(len(lst)):
            for key in lst[i][1]:
                if key not in dct:
                    dct[key] = [lst[i][1][key]]
                else:
                    if lst[i][1][key] not in dct[key]:
                        dct[key].append(lst[i][1][key])
    i += 1

