'''
1. Поработайте с переменными, создайте несколько, выведите на экран,
запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
'''
# исходные переменные
int_value = 4221
float_value = 3.1415
str_value = 'Ангостура'
bool_value = False

print(f'исходные значения переменных: \n целое число: {int_value}\n число с плавающей точкой: {float_value}\n'
      f' строка: {str_value}\n булево значение: {bool_value}')
# спросим у пользователя новые значения переменных
int_value = int(input(f'Введите новое целое число: '))
float_value = float(input(f'Введите новое число с плавающей точкой: '))
str_value = input(f'Введите новое строку: ')
while True:
    bool_value = input(f'Введите новое булево значение, т.е. True или False: ')
    if bool_value not in ['False', 'True']:
        print(f'Вы ввели недопустимое значение, введите True или False')
    else:
        break
print(f'новые значения переменных:\n целое число: {int_value}\n число с плавающей точкой: {float_value}\n'
      f' строка: {str_value}\n булево значение: {bool_value}')
