'''
Узнайте у пользователя число n.
Найдите сумму чисел n + nn + nnn.
Например, пользователь ввёл число 3.
Считаем 3 + 33 + 333 = 369.
'''
n = input(f'Введите n: ')
nn = int(n*2)
nnn = int(n*3)
print(f'Cумма n + nn + nnn: {int(n) + nn + nnn}')
