'''
5. Запросите у пользователя значения выручки и издержек фирмы.
Определите, с каким финансовым результатом работает фирма
(прибыль — выручка больше издержек, или убыток — издержки больше выручки).
Выведите соответствующее сообщение. Если фирма отработала с прибылью,
вычислите рентабельность выручки (соотношение прибыли к выручке).
Далее запросите численность сотрудников фирмы и определите
прибыль фирмы в расчете на одного сотрудника.
'''

proceeds = int(input('Введите значение выручки: '))
costs = int(input('Введите значение издержек: '))
if costs > proceeds:
    print(f'Издержки больше выручки! Убыток составил: {costs - proceeds}')
elif costs == proceeds:
    print(f'Издержки и прибыль равны!')
else:
    print(f'Выручка больше издержек! Прибыль составила: {proceeds - costs}')
    numbers = int(input('Введите численность сотрудников фирмы: '))
    while True:
        if numbers <= 0:
            print(f'Вы ввели 0 или отрицательное число сотрудников! Такое не может быть!')
            numbers = int(input(f'Введите численность сотрудников фирмы: '))
        else:
            break
    print(f'Прибыль фирмы в расчете на одного сотрудника составила: {(proceeds - costs)/numbers}')
