'''
Реализовать два небольших скрипта:
а) итератор, генерирующий целые числа, начиная с указанного,
б) итератор, повторяющий элементы некоторого списка, определенного заранее.
Подсказка: использовать функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным.
Необходимо предусмотреть условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
'''
from itertools import count, cycle


lst = [1,2,3,4,5]
def iterator(num=3, lst= [1,2,3]):
    flag = 0
    for i in count(num):
        if i > num+9:
            break
        print(i)
    print('*'*10)
    for i in cycle(lst):
        flag += 1
        print(i)
        if flag > 10:
            break


iterator(61,lst)
