'''
Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.
'''
from sys import argv


def calc_salary(hours, rate, bonus):
    return f'{hours*rate + bonus}'


hours, rate, bonus = argv[1:]
print('Запрплата сотрудника составила: ', calc_salary(int(hours), int(rate), int(bonus)))

