"""
Реализовать класс Matrix (матрица).
Обеспечить перегрузку конструктора класса (метод __init__()),
который должен принимать данные (список списков) для формирования матрицы.
Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
Примеры матриц вы найдете в методичке.
Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
Далее реализовать перегрузку метода __add__() для реализации операции
сложения двух объектов класса Matrix (двух матриц). Результатом сложения должна быть новая матрица.
Подсказка: сложение элементов матриц выполнять поэлементно —
первый элемент первой строки первой матрицы складываем с первым элементом первой строки второй матрицы и т.д.
"""


class Matrix:
    def __init__(self, array):
        self.array = array

    def __str__(self):
        return '\n'.join(map(str, self.array))

    def __add__(self, other):
        c = []
        for x in range(len(self.array)):
            c.append([])
            for y in range(len(self.array[0])):
                c[x].append(self.array[x][y] + other.array[x][y])
        return '\n'.join(map(str, c))



a = [[1,1,1], [2,2,2], [3,3,3]]
b = [[1,1,1], [1,1,1], [1,1,1]]

A = Matrix(a)
B = Matrix(b)
print(A)
print('*'*10)
print(B)
print('*'*10)
print(A+B)