'''
Создать класс TrafficLight (светофор)
и определить у него один атрибут color (цвет)
и метод running (запуск). Атрибут реализовать как приватный.
В рамках метода реализовать переключение светофора
в режимы: красный, желтый, зеленый.
Продолжительность первого состояния (красный)
составляет 7 секунд, второго (желтый) — 2 секунды,
третьего (зеленый) — на ваше усмотрение.
Переключение между режимами должно осуществляться
только в указанном порядке (красный, желтый, зеленый).
Проверить работу примера, создав экземпляр и вызвав описанный метод.
Задачу можно усложнить, реализовав проверку порядка режимов,
и при его нарушении выводить соответствующее сообщение и завершать скрипт.
'''

import time
import turtle


class TrafficLight:

    def __init__(self, count):
        self.__color = ['red', 'yellow', 'green']
        # количиство циклов светофора
        self.count = count

    def running(self):
        count = 0
        while True:
            if count == self.count:
                break
            for _ in self.__color:
                print(_)
                turtle.bgcolor(_)
                if _ == 'red':
                    time.sleep(7)
                elif _ == 'yellow':
                    time.sleep(2)
                else:
                    time.sleep(10)
            count += 1


A = TrafficLight(1)
A.running()
