'''
Необходимо создать (не программно) текстовый файл,
где каждая строка описывает учебный предмет и наличие лекционных,
практических и лабораторных занятий по этому предмету и их количество.
Важно, чтобы для каждого предмета не обязательно были все типы занятий.
Сформировать словарь, содержащий название предмета
и общее количество занятий по нему.
Вывести словарь на экран.
Примеры строк файла:
Информатика: 100(л) 50(пр) 20(лаб).
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —
Пример словаря:
{“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
'''

dct = {}
with open('text_6.txt', encoding='utf-8') as file:
    new_lines = [line.split(':') for line in file.readlines()]
    print(new_lines)
    for i in new_lines:
        s = ''
        for j in range(len((i[1]))-1):
            if i[1][j].isdigit() or i[1][j] == ' ':
                s += i[1][j]
        summ = 0
        for j in s.split(' '):
            if j.isdigit():
                summ += int(j)
        dct[[i][0][0]] = summ


print(dct)
